<script setup>
import {  h } from "vue";
import { NH1,NH2,NH3,NH4,NH5,NH6 } from 'naive-ui'

</script>

<template>
    <div class="content">
        <n-h4 style="color:#7ea08d;">
            中检质技（北京）金银珠宝质量检验中心 
        </n-h4>
        

        <div class="gline"></div>
        <p>
            中检质技（北京）金银珠宝质量检验中心及其从事检测业务的分支机构（以下简称本中心）是公正第三方珠宝玉石及贵金属检测专业机构。
        </p>
        <p>
            本中心的质量方针是公正、科学、准确、高效。
        </p>
        <p>
            本中心的服务宗旨是以质量为基准、服务为根本、科学为原则，力求提供准确、客观、及时和实惠的优质服务。
        </p>
        <p>
            为确保本中心的检测工作质量，表明公正立场，特发布检测公正性声明如下：
        </p>
        <p>1. 本中心全体工作人员始终严格执行国家有关法律法规和方针政策，遵循客观独立、公平公正、诚实信用的原则，恪守职业道德，承担社会责任。</p>
        <p>2. 本中心不受任何机关、单位和个人的干扰，独立开展第三方检测活动，保证对所有客户提供相同质量的检测服务，保证所出具的结论和数据科学、准确、公正。</p>
        <p>3. 本中心具有独立法人资格，能独立承担相应权利和义务。</p>
        <p>4. 本中心保证对所有客户的技术和专利及其有关信息保守机密，不以任何方式向其他客户透露任何产品信息。</p>
        <p>5. 本中心全体工作人员不受来自内外部的、不正当的商业、财务和其他方面的压力和影响，不受各方面经济利益的影响，确保检验检测数据、结果的真实、客观、准确和可追溯。</p>
        <p>6. 本中心全体工作人员不在其他检验检测机构兼职从业，不与其从事的检测活动以及出具的数据和结果存在利益关系，不参与任何有损于检测判断的独立性和诚信度的活动，不参与和检测项目有关的产品设计、研制、生产、供应、安装、使用或者维护活动。</p>
        <p>特此声明</p>
    </div>
</template>

<style scoped>
.content{
    background: #f3f3f3;
    border-radius:15px;
    padding: 20px;
}
.content > p{
    text-align: left;
    text-indent:2em; 
    padding-bottom:10px;
}
.gline{
    height: 1px;    
    background:linear-gradient(to left,#f3f3f3,#d8E6b6,#f3f3f3);
}
</style>