<script setup>
  import { NH6,NA,NP } from 'naive-ui'
</script>

<template>
    <n-h6 prefix="bar">
       技术团队
    </n-h6>
	<n-p>
	中心技术力量雄厚，拥有一批经验丰富、专业知识全面的从事贵金属分析、珠宝玉石鉴定、钻石鉴定分级和首饰检测的学士、硕士、博士生、高级工程师和高素质的管理团队；
	人员均毕业于国家重点专业院校或国外知名学府，并分别取得国内、国际权威机构颁发的CGC国家珠宝玉石注册质检师资格证书、资产评估师（珠宝）执业资格证书、NGTC珠宝鉴定及钻石分级资格证书、GAC珠宝鉴定师资格证书、GIC珠宝鉴定及钻石分级资格证书、英国FGA宝玉石鉴定师证书、美国GIA钻石分级师证书、比利时HRD钻石分级师证书。并在多次国内、国际比对中均取得了较好的成绩。
	</n-p>
    <n-h6 prefix="bar">
       设备
    </n-h6>	
	<n-p>
	中心拥有从美国、日本、法国、德国等进口的X-射线衍射仪、X-射线能谱仪、红外光谱仪、电子探针仪、全自动钻石比例分析仪、贵金属分析仪、合成钻石筛选仪等大型精密测试检验设备和常规检测鉴定仪器，仪器设备配置已超过国内外同类级别检验机构（实验室），代表国际先进水平，能充分满足贵金属、首饰检测和珠宝玉石鉴定、钻石鉴定分级等业务的需要，为精准的数据提供了有力的保障。		
	</n-p>
	<router-link to="/" #="{ navigate, href }" custom>
		<n-a :href="href" @click="navigate">
		回到主页
		</n-a>
	</router-link>	
</template>